notebook/orgmode.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>orgmode</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-02 19:51:39 EDT"/>
<meta name="author" content="David O'Toole"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel='stylesheet' href="/eon.css" type="text/css"/><link href='http://fonts.googleapis.com/css?family=Ubuntu:regular,italic,bold' rel='stylesheet' type='text/css'/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">orgmode</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">About </h2>
<div class="outline-text-2" id="text-1">


<p>
Org-mode is a great personal information manager and project planning
tool for <a href="GnuEmacs.html">Gnu Emacs</a>. You can get it from the <a href="http://staff.science.uva.nl/~dominik/Tools/org/">org-mode home page</a>. I've
also posted a brief <a href="OrgTutorial.html">illustrated tutorial for org-mode</a>.
</p>
<p>
I've extended the HTML publishing support of Org-mode to allow
configurable publishing of related sets of files as a complete
website. My extension is called <b>org-publish</b>, and is used to upload
and manage these very pages!
</p>
<p>
 <b>Org-publish is now part of the org-mode distribution</b>. You no longer
 need to download it separately. I will continue to host other
 extensions, such as blogging and e-script publishing support, on this
 page.
</p>
<p>
<a href="../e/org-publish.el">org-publish.el</a> can currently do the following: 
</p>
<ul>
<li>Publish all one's org-files to html
</li>
<li>Upload html, images, attachments and other files to a web server
</li>
<li>Exclude selected private pages from publishing
</li>
<li>Publish a clickable index of pages
</li>
<li>Manage local timestamps, for publishing only changed files
</li>
<li>Accept plugin functions to extend range of publishable content
</li>
</ul>


<p>
Much more functionality is planned. 
</p>
<p>
Special thanks to the org-mode maintainer, Carsten Dominik, for his
ideas, enthusiasm, and cooperation.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Downloads </h3>
<div class="outline-text-3" id="text-1-1">


<ul>
<li><a href="../e/org-publish.el">org-publish.el</a> &ndash; Requires at least <a href="http://staff.science.uva.nl/~dominik/Tools/org/org-4.27.tar.gz">version 4.27</a> of <b>org.el</b>.
</li>
<li><a href="../e/org-publish-escript.el">org-publish-escript.el</a> &ndash; (experimental) support for publishing <a href="EevMode.html">EevMode</a> e-scripts. requires <b>org-publish.el</b>.
</li>
<li><a href="../e/org-blog.el">org-blog.el</a> &ndash; (experimental) blogging support. requires <b>org-publish.el</b>.
</li>
<li><a href="../e/org-timeclock.el">org-timeclock.el</a> &ndash; (experimental) Basic support for timeclock.el
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Useful links </h3>
<div class="outline-text-3" id="text-1-2">


<ul>
<li><a href="http://staff.science.uva.nl/~dominik/Tools/org/">org-mode home page</a>
</li>
<li>my <a href="OrgTutorial.html">Org tutorial</a>
</li>
<li><a href="http://notes.aufrank.net/development/emacs/org.html">http://notes.aufrank.net/development/emacs/org.html</a>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Tasks </h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="todo TODO"> TODO</span>  </h3>
<div class="outline-text-3" id="text-2-1">

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="done DONE"> DONE</span> Fix reported bugs </h3>
<div class="outline-text-3" id="text-2-2">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2007-03-21 Wed</span></span>  <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2007-03-21 Wed 22:31</span></span><br/>
</p>
</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="done DONE"> DONE</span> Save window configuration when org-publish-all </h4>
<div class="outline-text-4" id="text-2-2-1">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2007-03-21 Wed 22:27</span></span><br/>
</p></div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="done DONE"> DONE</span> Create missing directories in .org-timestamps when publishing </h4>
<div class="outline-text-4" id="text-2-2-2">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2007-03-21 Wed 22:30</span></span><br/>
</p></div>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="todo TODO"> TODO</span> Handle subdirs. </h3>
<div class="outline-text-3" id="text-2-3">

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="todo TODO"> TODO</span> Syndication support </h3>
<div class="outline-text-3" id="text-2-4">


</div>

<div id="outline-container-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="todo TODO"> TODO</span> org-export-as-html region before publishing </h4>
<div class="outline-text-4" id="text-2-4-1">

</div>

</div>

<div id="outline-container-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="todo TODO"> TODO</span> Fix "description vs. body" issue </h4>
<div class="outline-text-4" id="text-2-4-2">

</div>

</div>

<div id="outline-container-2-4-3" class="outline-4">
<h4 id="sec-2-4-3"><span class="todo TODO"> TODO</span> Date in RSS feed should be date of first publication, not last modification </h4>
<div class="outline-text-4" id="text-2-4-3">

</div>

</div>

<div id="outline-container-2-4-4" class="outline-4">
<h4 id="sec-2-4-4"><span class="todo TODO"> TODO</span> Document RSS support </h4>
<div class="outline-text-4" id="text-2-4-4">

</div>

</div>

<div id="outline-container-2-4-5" class="outline-4">
<h4 id="sec-2-4-5"><span class="done DONE"> DONE</span> Basic RSS support </h4>
<div class="outline-text-4" id="text-2-4-5">

<p>     <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2006-10-25 Wed 19:25</span></span><br/>
</p><ul>
<li>GData: <a href="http://code.google.com/apis/gdata/index.html">http://code.google.com/apis/gdata/index.html</a>
</li>
<li>Atom: <a href="http://www.atomenabled.org/developers/syndication/">http://www.atomenabled.org/developers/syndication/</a>
</li>
<li>RSS: <a href="http://www.rssboard.org/rss-specification">http://www.rssboard.org/rss-specification</a>
</li>
<li><a href="http://sacha.free.net.ph/notebook/darcs/dev/planner/planner-rss.el">http://sacha.free.net.ph/notebook/darcs/dev/planner/planner-rss.el</a>
</li>
<li><i>zedek</i> would like to work on RSS output.     
</li>
</ul>

</div>

</div>

<div id="outline-container-2-4-6" class="outline-4">
<h4 id="sec-2-4-6"><span class="todo TODO"> TODO</span> Grab first paragraph as synopsis&hellip; </h4>
<div class="outline-text-4" id="text-2-4-6">

</div>

</div>

<div id="outline-container-2-4-7" class="outline-4">
<h4 id="sec-2-4-7"><span class="todo TODO"> TODO</span> Fix: kill .org buffers that were not open before publishing </h4>
<div class="outline-text-4" id="text-2-4-7">


</div>

</div>

<div id="outline-container-2-4-8" class="outline-4">
<h4 id="sec-2-4-8"><span class="todo TODO"> TODO</span> Categorizing posts via org TAGS </h4>
<div class="outline-text-4" id="text-2-4-8">

</div>
</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="todo TODO"> TODO</span> Record publishing status of subprojects so they don't get published twice </h3>
<div class="outline-text-3" id="text-2-5">

</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="todo TODO"> TODO</span> Allow meta-indices of various depths (overview, sitemap) </h3>
<div class="outline-text-3" id="text-2-6">

</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="todo TODO"> TODO</span> Allow publishing work reports </h3>
<div class="outline-text-3" id="text-2-7">

</div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="todo TODO"> TODO</span> Fix organization of big docstring </h3>
<div class="outline-text-3" id="text-2-8">

</div>

</div>

<div id="outline-container-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="todo TODO"> TODO</span> Fix index.org buffers not getting blitzed. </h3>
<div class="outline-text-3" id="text-2-9">

</div>

</div>

<div id="outline-container-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="done DONE"> DONE</span> Simple blogging support </h3>
<div class="outline-text-3" id="text-2-10">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">CLOSED: </span> <span class="timestamp">2006-10-25 Wed 18:02</span></span><br/>
</p></div>

</div>

<div id="outline-container-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="todo TODO"> TODO</span> Image gallery indexes </h3>
<div class="outline-text-3" id="text-2-11">

<p>Make index functions pluggable. Then a project could publish the image
files using org-publish-attachment, but the index could be generated
by a special function that uses M-x thumbs mode to generate thumbnails
and upload them into a gallery-type page.
</p>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2011-08-02 19:51:39 EDT</p>
<p class="author">Author: David O'Toole</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
